packages/laravel-seo-tools-master/SEO/src/Http/Controllers/Admin/DashboardController.php

select * from `seo_settings` limit 10 offset 0
select count(*) as aggregate from `seo_settings`
select count(*) as aggregate from `seo_pages`
select count(*) as aggregate from `seo_meta_tags`
---
    public function index(Request $request)
    {
        $metaTags = MetaTag::withGroupBy('', 'global');
        $data = [
            'records' => Setting::paginate(10),
            'model' => new Setting(),
            'page_total' => Page::count(),
            'meta_tag_total' => MetaTag::count(),
            'setting_total' => Setting::count(),
            'webmasterTags' => isset($metaTags['webmaster_tools']) ? $metaTags['webmaster_tools'] : []
        ];

select * from `seo_settings` limit 10 offset 0
select count(*) as aggregate from `seo_settings`
---
    public function social()
    {
        $metaTags = MetaTag::forGlobal();
        $data = [
            'records' => Setting::paginate(10),
            'og' => isset($metaTags['og']) ? $metaTags['og'] : [],
            'twitter' => isset($metaTags['twitter']) ? $metaTags['twitter'] : [],
            'model' => new Setting(),
        ];

select * from `seo_pages` where `robot_index` = 'index' limit 15 offset 0
select count(*) as aggregate from `seo_pages` where `robot_index` = 'index'
---
    public function sitemap()
    {
        $data = [
            'pages' => Page::where('robot_index', 'index')->paginate(15),
            'sitemaps' => (new SiteMap())->all()
        ];