packages/laravel-seo-tools-master/SEO/src/Http/Controllers/Admin/MetaTagController.php

select count(*) as aggregate from `seo_meta_tags`
---
    public function index(Index $request)
    {
        return view('seo::admin.pages.meta_tags.index', ['records' => MetaTag::paginate(6)]);

insert into `seo_page_meta_tags` (`seo_page_id`, `seo_meta_tag_id`, `updated_at`, `created_at`) values ('', 3, '2023-05-07 01:51:21', '2023-05-07 01:51:21')
select * from `seo_page_meta_tags` where (`seo_page_id` is null and `seo_meta_tag_id` = 3) limit 1
update `seo_page_meta_tags` set `content` = 'https://www.wasyheni.me.uk', `seo_page_meta_tags`.`updated_at` = '2023-05-07 01:51:21' where `id` = 3
---
    public function global(Request $request)
    {
        $metaValues = $request->get('meta', []);
        foreach ($metaValues as $id => $content) {
            $pageMeta = PageMetaTag::firstOrCreate(['seo_page_id' => null, 'seo_meta_tag_id' => $id]);
            $pageMeta->content = $content;
            $pageMeta->save();