packages/laravel-seo-tools-master/SEO/src/Http/Controllers/Admin/PageController.php

select distinct `object` from `seo_pages`
select count(*) as aggregate from `seo_pages`
---
    public function index(Index $request)
    {
        $q = $request->get('search');
        $object = $request->get('object');
        $builder = Page::withCount(['pageImages']);
        if (!empty($q)) {
            $builder = $builder->search($q);
        }
        if (!empty($object)) {
            $builder = $builder->where('object', $object);
        }
        return view('seo::admin.pages.pages.index', [
            'objects' => DB::table('seo_pages')->distinct()->get(['object'])->pluck('object')->toArray(),
            'records' => $builder->latest()->paginate(6)
        ]);

insert into `seo_pages` (`title`, `robot_index`, `robot_follow`, `path`, `canonical_url`, `description`, `focus_keyword`, `updated_at`, `created_at`) values ('Voluptatem nisi eos vel commodo harum saepe duis ea sit eos nostrud labore rerum fugiat id aut Nam', 'noindex', 'nofollow', 'https://www.sel.us', 'Tempora anim aperiam dignissimos quae ullamco aliquam est porro dolor quia doloremque odit iure esse', 'Odit magni rem cum Nam veniam mollit illum incidunt culpa consequatur Consequuntur deleniti', '', '2023-05-07 02:18:38', '2023-05-07 02:18:38')
---
    public function store(Store $request)
    {
        $model = new Page;
        $model->fill($request->get('page'));

        if ($model->save()) {

update `seo_pages` set `path` = 'https://www.gyxywixoc.me', `robot_index` = 'index', `robot_follow` = 'follow', `canonical_url` = 'Libero ipsam voluptatibus sed cumque laborum Incidunt', `title` = 'Nulla dolor amet quo ut consequat Eius enim deserunt omnis', `description` = 'Rerum et consequuntur velit qui enim fugit velit', `focus_keyword` = 'Facere impedit repu', `seo_pages`.`updated_at` = '2023-05-07 04:07:31' where `id` = 9
---
    public function update(Update $request, Page $page)
    {
        $page->fill($request->get('page'));

        if ($page->save()) {

delete from `seo_pages` where `id` = 10
---
    public function destroy(Destroy $request, Page $page)
    {
        if ($page->delete()) {