packages/laravel-seo-tools-master/SEO/src/Http/Controllers/Admin/SettingController.php

    public function store(Store $request)
    {
        $settings = $request->get('settings', []);
        foreach ($settings as $key => $fields) {
            $setting = Setting::where('key', $key)->first();
            if(empty($setting))
                $setting = new Setting();
            // Update the fields
            $setting->key = $key;
            $setting->value = $fields['value'];

            // Save the changes to the database
            $setting->save();
---
select * from `seo_settings` where `key` = 'facebook_page_url' limit 1
insert into `seo_settings` (`key`, `value`, `updated_at`, `created_at`) values ('facebook_page_url', 'https://www.vykuwenyqa.us', '2023-05-07 01:40:05', '2023-05-07 01:40:05')