packages/laravel-seo-tools-master/SEO/src/Models/Page.php

select * from `seo_page_images` where `seo_page_images`.`page_id` is null and `seo_page_images`.`page_id` is not null limit 1
---
    public function getLeadImageAttribute($for = 'og')
    {
        $image = $this->pageImages()->first();

insert into `seo_page_meta_tags` (`seo_page_id`, `seo_meta_tag_id`, `updated_at`, `created_at`) values (3, 4, '2023-05-07 02:18:38', '2023-05-07 02:18:38')
select * from `seo_page_meta_tags` where (`seo_page_id` = 3 and `seo_meta_tag_id` = 4) limit 1
update `seo_page_meta_tags` set `content` = '', `seo_page_meta_tags`.`updated_at` = '2023-05-07 02:18:38' where `id` = 25
---
    public function saveMeta($metaValues)
    {
        $retArr = [];
        foreach ($metaValues as $id => $content) {
            $pageMeta = PageMetaTag::firstOrCreate(['seo_page_id' => $this->id, 'seo_meta_tag_id' => $id]);
            $pageMeta->content = $content;
            $pageMeta->save();