packages/laravel-seo-tools-master/SEO/src/Models/Setting.php

select * from `seo_settings` where `key` = 'robot_index' limit 1
---
    public function getValueByKey($key, $column = 'value')
    {
        $settings = static::where('key', $key)->first();