packages/laravel-seo-tools-master/SEO/src/Policies/PagePolicy.php

    public function before(User $user)
    {
        if (isset($user->role()->first()->name) && $user->role()->first()->name === "Administrator") {
---
select * from `roles` where `roles`.`id` = 1 limit 1