laravel-seo-tools-master/SEO/src/Services/SiteMap.php

    public function page()
    {
        $this->total = Page::count();
---
select count(*) as aggregate from `seo_pages`