packages/laravel-seo-tools-master/SEO/src/Services/SchemaBuilder.php

    public function __construct()
    {
        $this->settings = Setting::where('group', 'ownership')->pluck('value', 'key')->toArray();
        $this->socialAccounts = Setting::where('group', 'social_media_links')->pluck('value', 'key')->toArray();
---
select `value`, `key` from `seo_settings` where `group` = 'ownership'
select `value`, `key` from `seo_settings` where `group` = 'social_media_links'